//--------------------------------------------------------------------------------
//
//	鍵の処理 [Key.h]
//	Author:Yuna Sumikawa
//
//--------------------------------------------------------------------------------
#ifndef  _KEY_H_
#define	_KEY_H_

#include "main.h"

//--------------------------------------------------------------------------------
//	鍵の構造体
//--------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXVECTOR3 keyVec;		// 鍵とプレイヤーのベクトル
	float fWidth;			// 幅
	float fHeight;			// 高さ
	float fLength;			// 長さ
	float fRadius;			// 半径
	bool bUse;				// 使用しているかどうか

	int nIdx;				// 影
} KEY;

//--------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------
HRESULT InitKey(void);
void UninitKey(void);
void UpdateKey(void);
void DrawKey(void);

#endif