#if 0

//--------------------------------------------------------------------------------
//
//	モデルの処理 [Model.h]
//	Author:Yuna Sumikawa
//
//--------------------------------------------------------------------------------
#ifndef  _MODEL_H_
#define	_MODEL_H_

#include "main.h"

//--------------------------------------------------------------------------------
//	弾の構造体
//--------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXVECTOR3 move;		// 移動量
	D3DXVECTOR3 rot;		// 向き
}MODEL;

//--------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------
void InitModel(void);
void UninitModel(void);
void UpdateModel(void);
void DrawModel(void); 
MODEL *GetModel(void);

#endif

#endif