//--------------------------------------------------------------------------------
//
//	ポリゴンの処理 [polygon.h]
//	Author:Yuna Sumikawa
//
//--------------------------------------------------------------------------------
#ifndef  _POLYGON_H_
#define	_POLYGON_H_

#include "main.h"

//--------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------
HRESULT InitPolgon(void);
void UninitPolgon(void);
void UpdatePolgon(void);
void DrawPolgon(void);

#endif