//--------------------------------------------------------------------------------
//
//	始まりの画面の処理 [beginning.cpp]
//	Author:Yuna Sumikawa
//
//--------------------------------------------------------------------------------
#include "beginning.h"		// 始まり
#include "frame.h"			// 枠
#include "Pause.h"			// ポーズ
#include "fade.h"			// フェード
#include "keyboard.h"		// キー入力
#include "sound.h"			// サウンド
#include "Bookshelf.h"		// 本棚
#include "2Dplayer.h"		// 2Dプレイヤー

//-------------------------------------------------------------------------------
//	グローバル変数
//-------------------------------------------------------------------------------


//-------------------------------------------------------------------------------
//	初期化処理
//-------------------------------------------------------------------------------
HRESULT InitBeginning(void)
{
	// 枠の初期化処理
	InitFrame();

	// 本棚の初期化処理
	InitBookshelf();

	// 2Dプレイヤーの初期化処理
	Init2DPlayer();

	return S_OK;
}

//-------------------------------------------------------------------------------
//	終了処理 
//-------------------------------------------------------------------------------
void UninitBeginning(void)
{
	// 2Dプレイヤー
	Uninit2DPlayer();

	// 本棚の終了処理
	UninitBookshelf();

	// 枠の終了処理
	UninitFrame();
}

//-------------------------------------------------------------------------------
//	更新処理
//-------------------------------------------------------------------------------
void UpdateBeginning(void)
{
	//フェード
	int nFade = GetFade();



	if (nFade == FADE_NONE)
	{//　フェード中は動けない
		if (GetkeyboardTrgger(DIK_RETURN) == true)
		{//　エンターキーを押した
			// 枠の更新処理
			UpdateFrame();

			// 本棚の更新処理
			UpdateBookshelf();

			// 2Dプレイヤー
			Update2DPlayer();

			// チュートリアル画面に移動
			SetFade(FADE_OUT, MODE_GAME);

			//音止める
			StopSound();
		}
	}
}


//-------------------------------------------------------------------------------
//	描画処理
//-------------------------------------------------------------------------------
void DrawBeginning(void)
{
	// 枠の描画処理
	DrawFrame();

	// 本棚の描画処理
	DrawBookshelf();

	// 2Dプレイヤー
	Draw2DPlayer();

}

//-------------------------------------------------------------------------------
//	ポーズ処理
//-------------------------------------------------------------------------------
