//--------------------------------------------------------------------------------
//
//	ブロックの処理 [block.h]
//	Author:Yuna Sumikawa
//
//--------------------------------------------------------------------------------
#ifndef  _BLOCK_H_
#define	_BLOCK_H_

#include "main.h"

//--------------------------------------------------------------------------------
//	マクロ定義
//--------------------------------------------------------------------------------
#define MAX_BLOCK		(1)		// 読み込むパーツ数

//--------------------------------------------------------------------------------
// ブロックの構造体
//--------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;				// 位置
	D3DXVECTOR3 blockVec;			// ブロックとプレイヤーのベクトル
	D3DXVECTOR3 rot;				// 向き
	D3DXVECTOR3 move;				// 移動量
	D3DXMATRIX mtxWorld;			// ワールドマトリックス

	float fWidth;					// 幅
	float fHeight;					// 高さ
	float fLength;					// 長さ
	float fRadius;					// 半径

	bool bUse;						// 使用しているかどうか
									
}Block;

//--------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------
HRESULT InitBlock(void);
void UninitBlock(void);
void UpdateBlock(void);
void DrawBlock(void);

Block *GetBlock(void);

#endif