//--------------------------------------------------------------------------------
//
//	本棚の処理 [Bookshelf.h]
//	Author:Yuna Sumikawa
//
//--------------------------------------------------------------------------------
#ifndef  _BOOKSHELF_H_
#define	_BOOKSHELF_H_

#include "main.h"

//--------------------------------------------------------------------------------
//	扉の構造体
//--------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;		//位置
	bool bUse;				//使用しているかどうか
} Bookshelf;

//-------------------------------------------------------------------------------
//プロトタイプ宣言
//-------------------------------------------------------------------------------
HRESULT InitBookshelf(void);
void UninitBookshelf(void);
void UpdateBookshelf(void);
void DrawBookshelf(void);

#endif