//--------------------------------------------------------------------------------
//
//	ゴールの処理 [Goal.h]
//	Author:Yuna Sumikawa
//
//--------------------------------------------------------------------------------
#ifndef  _GOAL_H_
#define	_GOAL_H_

#include "main.h"

//--------------------------------------------------------------------------------
//	マクロ定義
//--------------------------------------------------------------------------------
#define MAX_GOAL		(1)		// 読み込むパーツ数

//--------------------------------------------------------------------------------
// モデルの構造体
//--------------------------------------------------------------------------------
typedef struct
{
	LPD3DXMESH pMesh;				// メッシュ(頂点情報)へのポインタ
	LPD3DXBUFFER pBuffMat;			// マテリアルへのポインタ
	DWORD nNumMat;					// マテリアルの数
	D3DXVECTOR3 pos;				// 位置(オフセット)
	D3DXVECTOR3 rot;				// 向き
	D3DXMATRIX mtxWorld;			// ワールドマトリックス
	int nldModelParent;				// 親のモデルのインデックス
}ModelGoal;

//--------------------------------------------------------------------------------
// ブロックの構造体
//--------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;				// 位置
	D3DXVECTOR3 rot;				// 向き
	D3DXVECTOR3 move;				// 移動量
	D3DXMATRIX mtxWorld;			// ワールドマトリックス
	bool bUse;						// 使用しているかどうか

	float fWidth;					// 幅
	float fHeight;					// 高さ
									
	ModelGoal aModel[MAX_GOAL];	// モデル(パーツ)
	int nNumModel;					// モデル(パーツ)数
}Goal;

//--------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------
HRESULT InitGoal(void);
void UninitGoal(void);
void UpdateGoal(void);
void DrawGoal(void);

Goal *GetGoal(void);

#endif