//--------------------------------------------------------------------------------
//
//	チュートリアルの処理 [tutorial.h]
//	Author:Yuna Sumikawa
//
//--------------------------------------------------------------------------------
#ifndef  _TUTORIAL_H
#define	_TUTORIAL_H

#include "main.h"

//-------------------------------------------------------------------------------
//プロトタイプ宣言
//-------------------------------------------------------------------------------
HRESULT InitTutorial(void);
void UniniTtutorial(void);
void UpdateTutorial(void);
void DrawtuTorial(void);

#endif