#pragma once
//--------------------------------------------------------------------------------
//
//	フェードの処理 [fade.h]
//	Author:Yuna Sumikawa
//
//--------------------------------------------------------------------------------
#ifndef  _FADE_H_
#define	_FADE_H_

#include "main.h"

//--------------------------------------------------------------------------------
//	敵の列挙型
//--------------------------------------------------------------------------------
typedef enum
{
	FADE_NONE = 0,	//何もしていない
	FADE_IN,		//フェードイン
	FADE_OUT,		//フェードアウト
	FADE_MAX
} FADE;

//-------------------------------------------------------------------------------
//プロトタイプ宣言
//-------------------------------------------------------------------------------
HRESULT InitFade(MODE modeNext);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);
void SetFade(FADE fade, MODE wodeNext);
FADE GetFade(void);
#endif