//--------------------------------------------------------------------------------
//
//	セレクトの処理 [Select.h]
//	Author:Yuna Sumikawa
//
//--------------------------------------------------------------------------------
#ifndef  _SELECT_H_
#define	_SELECT_H_

#include "main.h"

//--------------------------------------------------------------------------------
//	セレクトの列挙型
//--------------------------------------------------------------------------------
typedef enum
{
	SELECT_MENU_TUTORIAL = 0,			//チュートリアル
	SELECT_MENU_GAMESTART,				//ゲームスタート
	SELECT_MODE_END,					//ゲーム終了
	SELECT_MENU_MAX
}SELECT_MENU;

//-------------------------------------------------------------------------------
//	構造体
//-------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;					//セレクトの移動(カーソルで使用)
} SELECT;

//-------------------------------------------------------------------------------
//プロトタイプ宣言
//-------------------------------------------------------------------------------
HRESULT InitSelect(void);
void UninitSelect(void);
void UpdateSelect(void);
void DrawSelect(void);

#endif