//--------------------------------------------------------------------------------
//
//	ストップ背景の処理 [StopBGBG.h]
//	Author:Yuna Sumikawa
//
//--------------------------------------------------------------------------------
#ifndef  _STOPBG_H_
#define	_STOPBG_H_

#include "main.h"

//-------------------------------------------------------------------------------
//プロトタイプ宣言
//-------------------------------------------------------------------------------
HRESULT InitStopBG(void);
void UninitStopBG(void);
void UpdateStopBG(void);
void DrawStopBG(void);

#endif